// Задача необязательная 2:
// считает  количество программистов  и произносит его вслух: "n программистов".
// Для того, чтобы это звучало правильно, для каждого n нужно использовать верное окончание слова.
// Напишите программу, считывающую с пользовательского ввода целое
//  число n (неотрицательное), выводящее это число в консоль вместе
//   с правильным образом изменённым словом "программист", для того,
//    чтобы робот мог нормально общаться с людьми, например: 1 программист,
//     2 программиста, 5 программистов.
// В комнате может быть очень много программистов. Проверьте,
//  что ваша программа правильно обработает все случаи, как минимум до 1000 человек.

int num = new Random().Next(1, 1);

Console.WriteLine(num); 

if (num ==1)
{
     Console.WriteLine($"привет: {num} программист!"); 
}
else if(num ==2)
{
   Console.WriteLine($"привет: {num} программиста!"); 
}
else if(num ==3)
{
   Console.WriteLine($"привет: {num} программиста!"); 
}
else if(num ==4)
{
   Console.WriteLine($"привет: {num} программиста!"); 
}
else
{
    Console.WriteLine($"привет: {num} программистов!");  
}