
// Задача 10: Напишите программу, которая принимает на вход
//  трёхзначное число и на выходе показывает вторую цифру этого числа.
//   Через строку решать нельзя.

// 456 -> 5
// 782 -> 8
// 918 -> 1

int num = new Random().Next(10, 1000-1);
Console.WriteLine($"сгенирированное число: {num}");
Console.WriteLine((num /10)%10);