// Задача 13: Напишите программу, которая выводит третью 
// цифру заданного числа или сообщает, что третьей цифры нет.
// Через строку решать нельзя.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6




Console.WriteLine("Введите число:");
int num = Convert.ToInt32(Console.ReadLine());
{
 while (num >= 1000-1)
   {
    num = num /10;
   int n =num;
   }
    if (num < 99) 
   {
    Console.WriteLine("число не трех значное");  
   }
   else 
   {
     Console.Write($"третья цифра = {num%10}");
   }

}
 
    


  
