
// Задача 2: Напишите программу, которая выводит 
// случайное трёхзначное число и удаляет вторую цифру 
// этого числа.
// 456 -> 46
// 782 -> 72
// 918 -> 98

int num = new Random().Next(100, 1000-1);
Console.WriteLine($"сгенерированное число1: {num}");

int x1 = num %10;
int x2 = num /100;

Console.WriteLine($" -> {x2*10+x1}");